Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/consumer_protection/consumer_rights/consumer_protection_act_2007.html.txt.tmx
Source language: en
Languages: ga

source: Consumer Protection Act 2007
ga: An tAcht um Chosaint Tomhaltóirí 2007

source: • Competition and Consumer Protection Commission
ga: • An Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí • Cosaint tomhaltóirí

source: The Consumer Protection Act 2007 came into effect in Ireland on 1 May 2007
ga: Tháinig an tAcht um Chosaint Tomhaltóirí 2007 i bhfeidhm in Éirinn ar 1 Bealtaine 2007

source: The Act provided for the establishment of the National Consumer Agency
ga: D'fhoráil an tAcht do bhunú na Gníomhaireachta Náisiúnta Tomhaltóirí

source: Under the Competition and Consumer Protection Act 2014 the National Consumer Agency and the Competition Authority were replaced by the Competition and Consumer Protection Commission
ga: Faoin Acht um Iomaíocht agus Cosaint Tomhaltóirí 2014, tá an Coimisiún Iomaíochta agus Cosaint Tomhaltóirí in ionad an Ghníomhaireacht Náisiúnta do Thomhaltóirí agus an tÚdarás Iomaíochta

source: The Commission took over the functions of the two agencies
ga: Ghlac an Coimisiún le feidhmeanna an dá ghníomhaireacht

source: The 2007 Act also put the EU Directive on unfair commercial practices into national law and it made various changes to our consumer laws
ga: Chuir an tAcht 2007 Treoir an AE i leith cleachtas tráchtála éagórach i bhfeidhm sa dlí náisiúnta, agus rinne sé athruithe éagsúla ar ár ndlíthe tomhaltóirí

source: It also repealed certain older consumer laws, some of which dated from the 19th century
ga: Rinne sé dlíthe tomhaltóirí níos sine, a ndeachaigh cuid acu siar chuig an 19ú haois, a aisghairm freisin

source: The Consumer Protection Act 2007 is quite complex and includes some detailed definitions
ga: Tá an tAcht um Chosaint Tomhaltóirí 2007 casta go leor agus tá roinnt sainmhínithe sonracha ann

source: The following is a summary of its main provisions:
ga: Seo a leanas achoimre ar príomhfhorálacha an Ailt:

source: Competition and Consumer Protection Commission
ga: An Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí

source: The Competition and Consumer Protection Commission (CCPC) was established on 31 October 2014 and took over the functions and powers of the National Consumer Agency
ga: Bunaíodh an Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí (CCPC) ar 31 Deireadh Fómhair 2014, agus ghlac sé na feidhmeanna agus cumhachtaí na Gníomhaireachta Náisiúnta do Thomhaltóirí

source: It has a general function of promoting consumer welfare and is responsible for investigating, enforcing and encouraging compliance with consumer law
ga: Is í an fheidhm ghinearálta atá aici ná leas tomhaltóirí a chur chun cinn agus tá sí freagrach as géilliúntas do dhlí tomhaltóirí a fhiosrú, a fhorfheidhmiú agus a spreagadh

source: It has a website for consumers
ga: Bhunaigh sí láithreán gréasáin do thomhaltóirí

source: There is more information on what the Commission does on its website
ga: Tá tuilleadh eolais ar an méid a dhéanann an Coimisiún ar a shuíomh gréasáin

source: The EU Unfair Commercial Practices Directive (Directive 2005/28/EC of 11 May 2005) (pdf) deals with unfair business-to-consumer commercial practices, (it does not apply to dealings between businesses)
ga: Pléann Treoir an AE i leith Cleachtas Tráchtála Éagórach (Treoir 2008/25/CE an 11 Bealtaine 2005) le cleachtais tráchtála gnó-go-tomhaltóir éagóracha (ní bhaineann sé le gnó idir gnóthaí)

source: The Consumer Protection Act 2007 provides for its implementation in Ireland
ga: Forálann an tAcht um Chosaint Tomhaltóirí 2007 dá forfheidhmiú in Éirinn

source: The Act provides that a range of unfair, misleading and aggressive trading practices are banned if they would be likely to cause appreciable impairment of the average consumer's ability to make an informed choice in relation to the product concerned and would cause the average consumer to make a decision about a transaction that they would not otherwise make
ga: Forálann an tAcht go gcuirfear cosc ar raon de chleachtais trádála eagóracha, míthreoracha agus fóbartacha más cosúil go laghdóidís go mór cumas an ghnáth-thomhaltóra rogha eolasach a dhéanamh maidir leis an táirge atá i gceist agus dá ndéanfadh an gnáth-thomhaltóir cinneadh faoi idirbheart dá mbarr nach ndéanfaidís ar chaoi eile

source: Practices are banned, therefore, if they meet two conditions:
ga: Mar sin, cuirtear cosc ar chleachtais má chomhlíonann siad dhá choinníoll:

source: They are unfair, misleading or aggressive
ga: Tá siad éagórach, míthreorach nó fóbartach

source: They are likely to distort your consumer's choice
ga: D'fhéadfadh siad rogha an tomhaltóra a riocht

source: The Act also provides that certain practices are always banned - these do not have to meet the second condition
ga: Forálann an tAcht freisin go mbeidh cosc i gcónaí ar chleachtais áirithe - ní gá go gcomhlíonfaidís siúd an dara coinníoll

source: There is more information on unfair commercial practices here
ga: Tá tuilleadh eolais ar chleachtais tráchtála éagóracha anseo

source: The Consumer Protection Act 2007 gives the Minister the power to make Regulations requiring that the prices of certain products be displayed in a specific manner
ga: Tugann an tAcht um Chosaint Tomhaltóirí 2007 cumhacht don Aire Rialacháin a dhéanamh a éilíonn go dtaispeánfaí praghsanna táirgí áirithe ar bhealach sonraithe

source: For example, they could provide that prices of certain products must be displayed inclusive of charges, fees and taxes
ga: Mar shampla, d'fhéadfaidís foráil nach mór praghsanna táirgí áirithe a thaispeáint agus muirir, táillí agus cánacha san áireamh

source: The Prices Acts 1958-1972 gave the Minister for Jobs, Enterprise and Innovation a range of powers to set maximum prices
ga: Thug na hAchtanna Praghsanna 1958-1972 raon cumhachtaí don Aire Poist, Fiontar agus Nuálaíochta le huasphraghsanna a leagan síos

source: The Act repeals all of these powers except the power to control prices in emergency situations
ga: Déanann an tAcht um Chosaint Tomhaltóirí 2007 na cumhachtaí sin go léir a aisghairm ach amháin an chumhacht praghsanna a rialú i gcás éigeandála

source: It provides that the power to control prices in emergency situations must be exercised by the government and not the Minister
ga: Forálann sé nach mór gurb é an Rialtas agus nach é an tAire a chleachtann an chumhacht praghsanna a rialú i gcás éigeandála

source: The Pyramid Selling Act 1980 was repealed by the Consumer Protection Act 2007 and replaced by new provisions
ga: Rinneadh an tAcht Stuaic-Dhíola 1980 a aisghairm ag an Acht um Chosaint Tomhaltóirí 2007 agus cuireadh forálacha nua ina áit

source: These provisions ban participation in pyramid schemes and inducing others to participate
ga: Cuireann na forálacha sin cosc ar rannpháirteachas i scéimeanna stuaic-dhíola agus ar chur ar dhaoine eile páirt a ghlacadh iontu

source: They also ban the establishment, operation or promotion of these schemes and increase the penalties for breaking the law
ga: Cuireann siad cosc freisin ar bhunú, ar oibriú nó ar chur chun cinn na scéimeanna sin agus méadaíonn siad na pionóis a ghearrtar as an dlí a bhriseadh

source: The new penalties for offences relating to pyramid schemes involve a fine of up to €150,000 and a prison term of up to five years
ga: Fíneáil suas le €150,000 agus téarma príosúin suas le cúig bliana atá i gceist leis na pionóis nua a ghearrfar as cionta maidir le scéimeanna stuaic-dhíola

source: The Consumer Protection Act 2007 provides for the recognition of codes of practice drawn up by traders or groups of traders and for the CCPC to approve such codes
ga: Fóralann an tAcht um Chosaint Tomhaltóirí 2007 d'aitheantas a thabhairt do chóid chleachtais a cheapann trádálaithe nó grúpaí trádálaithe agus do na cóid sin a cheadú ag an GNT

source: It also provides that the CCPC may issue guidelines to traders about consumer protection and welfare, commercial practices, quality assurance schemes and codes of practice
ga: Forálann sé freisin go bhféadann an GNT treoirlínte a eisiúint do thomhaltóirí i dtaobh cosaint agus leas tomhaltóirí, cleachtais tráchtála, scéimeanna dearbhaithe cáilíochta agus cóid chleachtais

source: The Act gives power to the Minister to introduce statutory guidelines for local authorities in regard to the issuing of casual trading licences
ga: Tugann an tAcht cumhacht don Aire treoirlínte reachtúla a thabhairt isteach d'údaráis áitiúla maidir le ceadúnais chorr-thrádála a eisiúint

source: Non-statutory guidelines were issued to local authorities in July 2005 and again in July 2006 with a view to their being implemented on a voluntary basis
ga: Eisíodh treoirlínte neamhreachtúla d'údaráis áitiúla in Iúil 2005 agus arís in Iúil 2006 agus é mar aidhm go gcuirfí i bhfeidhm iad ar bhonn deonach

source: If this does not prove satisfactory, the Minister can introduce statutory guidelines
ga: Murar leor iad sin, áfach, tá sé de rún ag an Aire treoirlínte reachtúla a thabhairt isteach

source: The Consumer Protection Act 2007 provides for enforcement mechanisms to be available to the CCPC
ga: Forálann an tAcht um Chosaint Tomhaltóirí 2007 do roinnt meicníochtaí forfheidhmithe a chur ar fáil don CCPC

source: If the CCPC considers that there is a case for looking for an injunction or a prohibition order against a trader, it may (as a first step) accept a written undertaking from the trader containing whatever terms and conditions the CCPC thinks are appropriate
ga: Má mheasann an CCPC go bhfuil fáth le hurghaire nó ordú coisc a lorg i gcoinne trádálaí, d'fhéadfadh sí (mar chéad chéim) glacadh le gealltanas scríofa ón trádálaí a bhfuil cibé téarmaí agus coinníollacha a mheasann an CCPC a bheith cuí ann

source: If the trader fails to comply with the undertaking, then the CCPC may look for a prohibition order
ga: Mura ngéilleann an trádálaí don ghealltanas, d'fhéadfadh an CCPC ordú toirmisc a lorg

source: The CCPC may serve a compliance notice on a trader whom it considers to have engaged in a prohibited activity
ga: D'fhéadfadh an CCPC fógra géilliúntais a sheirbheáil ar thrádálaí a mheasann sí go raibh sé/sí i mbun gníomhaíochta coiscthe

source: The trader has 14 days in which to appeal the notice
ga: Bíonn 14 lá ag an trádálaí le hachomharc a dhéanamh i gcoinne an fhógra

source: If the trader fails to comply, the CCPC may take criminal proceedings
ga: Mura ngéilleann an trádálaí don fhógra, féadann an CCPC imeachtaí coiriúla a thógáil

source: The CCPC has the power to impose on-the-spot penalties for offences relating to the display of prices
ga: Tá cumhacht ag an CCPC pionóis ar an láthair a ghearradh as ciontaí a bhaineann le taispeáint praghsanna

source: It is also required to keep a Consumer Protection List and to publish this list at any time and in any form it considers appropriate
ga: Freisin ní mór di Liosta Cosanta Tomhaltóirí a choimeád agus an liosta sin a fhoilsiú aon uair agus in aon fhoirm a mheasann sí a bheith cuí

source: This is a list of traders convicted of criminal offences, subject to court orders, bound by an undertaking, served with a compliance notice, or subject to a fixed payment notice
ga: Is é atá ansin ná liosta de thrádálaithe a ciontaíodh as cionta coiriúla, atá faoi réir orduithe cúirte, faoi réir gealltanais, a bhfuil fógra géilliúntais seirbheáilte orthu, nó atá faoi réir fógra íocaíochta seasta

source: The CCPC may apply to the courts for an order requiring a trader who has been convicted of a number of specified offences to publish, at his or her expense, a corrective statement in respect of the facts relating to the offence
ga: Féadann an CCPC iarraidh ar na cúirteanna ordú a fháil a éilíonn ar thrádálaí a ciontaíodh as roinnt ciontaí sonracha fógra ceartúcháin i dtaobh na bhfíricí maidir leis an gcion a fhoilsiú, agus íoc as

source: Role of the Central Bank
ga: Ról an Bhainc Ceannais na hÉireann

source: The Central Bank of Ireland has a role in enforcing the provisions of the Consumer Protection Act 2007 in the financial services area
ga: Tá ról ag an Bhainc Ceannais na hÉireann i bhforálacha an Achta um Chosaint Tomhaltóirí 2007 a fhorfheidhmiú i réimse na seirbhísí airgeadais

source: The CCPC and the Central Bank are required to have a co-operation agreement setting out their respective roles
ga: Éilítear ar an CCPC agus an Bhainc Ceannais comhaontú comhoibrithe a bheith acu eatarthu a leagann amach a róil faoi seach

source: The Act provides protection for people who report breaches of the legislation to the CCPC
ga: Soláthraíonn an tAcht cosaint do dhaoine a thuairiscíonn sáruithe na reachtaíochta don CCPC

source: Redress for individual consumers
ga: Cúiteamh do thomhaltóirí aonair

source: Anyone, including the CCPC, may apply to the Circuit Court or the High Court for an order prohibiting any practice (with some small exceptions) which is unlawful under the Consumer Protection Act 2007
ga: Féadann aon duine, lena n-áirítear an CCPC, cur isteach ar an gCúirt Chuarda nó an Ard-Chúirt le hordú a fháil a chuireann cosc ar aon chleachtas (ach le cúpla eisceacht bheag) atá mídhleathach faoin Acht um Chosaint Tomhaltóirí 2007

source: If an individual takes such an action, notice must be given to the trader and to the CCPC
ga: Má ghlacann duine aonair caingean den sórt sin, ní mór fógra a thabhairt don trádálaí agus don CCPC

source: It is not necessary to show loss or damage as a result of the trader's actions
ga: Ní gá caillteanas nó dochar de bharr ghníomhartha an trádálaí a thaispeáint

source: If a trader is convicted of an offence under the Act, it is open to the court to require the trader to pay damages to a consumer who has suffered loss as a result of the trader's actions
ga: Má chiontaítear trádálaí as cion faoin Acht, tá rogha ag an gCúirt éileamh go n-íocfadh an trádálaí damáistí leis an tomhaltóir a d'fhulaing caillteanas de bharr ghníomhartha an trádálaí

source: Such a compensation order may be instead of, or in addition to, any fine or penalty the court imposes on the trader
ga: D'fhéadfadh ordú cúitimh den sórt sin a dhéanamh in áit, nó i dteannta le haon fhíneáil nó pionóis a ghearrann an chúirt ar an trádálaí

source: Consumers who are aggrieved by a prohibited act or practice may sue the trader for damages
ga: D'fhéadfadh tomhaltóirí a chuireann gníomh nó cleachtas coiscthe astu agairt a dhéanamh i gcoinne trádálaí i leith damáistí

source: The Act provides for a range of penalties for the various offences
ga: Forálann an tAcht do raon pionós as na cionta éagsúla

source: The maximum fine for a first offence is €3,000 for summary convictions and €60,000 for convictions on indictment
ga: Is í an uasfhíneáil do chéad chion ná €3,000 do chiontuithe achoimre agus €60,000 do chiontuithe ar díotáil

source: There are higher fines for repeat offenders
ga: An Roinn Post, Fiontar agus Nuálaíochta
